import React from "react";
import { FaBook } from "react-icons/fa";
import styled from "styled-components";
import Button from "../components/layouts/Button";
import { Link } from "react-router-dom";

const Div = styled.div`
  .heading {
    border: 0px;
    font-size: 16px;
    font-weight: 600;
  }
  .para {
    border: 1px solid #b7b7b7;
    text-align: justify;
    padding: 10px;
  }

  hr {
    width: 10%;
    border: 2px solid red;
    margin-bottom: 5px;
  }
`;
const Info = () => {
  return (
    <Div>
      <p className="heading">
        {" "}
        <FaBook /> परिचय
      </p>
      <hr />
      <p className="para">
        विक्रम संवत् २०१० मा सृजना गरिएको सहकारी विभागले विकासको प्रक्रिया
        प्रारम्भ गर्ने काम दिइएका नेपाल सरकारका सुरुका थोरै निकायहरूको
        प्रतिनिधित्व गर्दछ । ऐतिहासिक जनआन्दोलनपछि नेपाल २००७ सालमा
        प्रजातन्त्रिक मुलुक भयो । जहानियाँ तन्त्रको लामो दौरानबाट मुक्त जनतामा
        विकासको आकाङ्क्षा थियो र नेताहरूलाई आफ्नो प्रतिज्ञाअनुसार गरेर देखाउनु
        थियो । प्रजातन्त्रले विकासको अगुवाइ गरिरहेका बखत जनसाधारणमाझ सहकारी
        आन्दोलन दुवैको आधार बन्न सक्तथ्यो । त्यसरी विभागलाई सहकारी प्रस्तावनालाई
        प्रश्रय दिएर गरिबको स्रोत गरिबीको समस्या समाधानार्थ लगाउनु थियो । आज
        विभागले आफ्नो साठी वर्ष बढीको कामलाई अधिक सन्तोषका साथ हेर्न सक्तछ कि
        देशमा पूर्ण आकारमा फैलिएको सहकारी आन्दोलन छ । पुगनपुग ६३ लाख साना कृषक,
        कालिगड, श्रमिक, उपभोक्ता र गरिबी कोष्ठका अरूहरूको संलग्नतामा सबै
        प्रान्त, जिल्ला र नगरपालिका वा गाउँपालिकामा सञ्चालित ३४ हजार बढी सहकारी
        सङ्घसंस्थाहरू सहित आन्दोलन क्रमशः शोषणविहीन आर्थिक सम्बन्धहरू प्रवर्धन
        गर्ने शक्तिको रूपमा विकसित भइरहेको छ ।
      </p>
      <Link to="http://deoc.gov.np/content/261/2017/36491157/">
        <Button />
      </Link>
    </Div>
  );
};

export default Info;
